Blizzard1900/STM32F10x_Car_Project-V1.0.0_distanceMeasurement/User_Driver/src/stm32f10x_PulseTime.c
/********************************************************************************
  * @file    stm32f10x_PulseTime.c
  * @author  W.Dong
  * @version V1.0.0
  * @date    07/08/2018
  * @brief   使用外部中断和定时器实现脉冲时间测量。
  *******************************************************************************/

/*-----------------------------------Includes -------------------------------*/
#include "stm32f10x_PulseTime.h"
#include <stm32f10x.h>
#include "stm32f10x_gpio.h"
#include "stm32f10x_exti.h"
#include "misc.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_rcc.h"
/** @addtogroup My_Drivers
  * @{
  */

/** @defgroup PulseTime_Drivers
  * @brief PulseTime 驱动模块
  * @{
  */


/** @defgroup PulseTime_Private_TypesDefinitions
  * @{
  */

/**
  * @brief 脉冲边沿跟踪状态机。
  */
typedef enum {
    PULSETIME_STATE_WAIT_START = 0,  /* 等待起始边沿 */
    PULSETIME_STATE_WAIT_STOP  = 1   /* 等待停止边沿 */
} PulseTime_State_Enum;

/**
  * @brief 每通道运行时测量数据。
  */
typedef struct {
    uint16_t             lastCNT;        /* 起始边沿时刻的定时器计数值 */
    PulseTime_State_Enum state;          /* 当前状态机状态             */
    float                fHighLevelTime; /* 测量的高电平时间 (us)      */
    float                fLowLevelTime;  /* 测量的低电平时间 (us)      */
    FlagStatus           fresh;          /* 新测量数据就绪标志         */
} PulseTime_Runtime_Struct;

/**
  * @} end: PulseTime_Private_TypesDefinitions
  */


/** @defgroup PulseTime_Private_Constants
  * @{
  */

/* 各精度对应的定时器预分频值 @ 72MHz 定时器时钟 */
static const uint16_t PulseTime_PSC_Table[] = {
    0,     /* Precision_0us014: 72MHz / (0+1)   = 72MHz  -> 0.014us/tick */
    8,     /* Precision_0us125: 72MHz / (8+1)   = 8MHz   -> 0.125us/tick */
    35,    /* Precision_0us5:   72MHz / (35+1)  = 2MHz   -> 0.5us/tick   */
    71,    /* Precision_1us:    72MHz / (71+1)  = 1MHz   -> 1us/tick     */
    719,   /* Precision_10us:   72MHz / (719+1) = 100KHz -> 10us/tick    */
    7199   /* Precision_100us:  72MHz / (7199+1)= 10KHz  -> 100us/tick   */
};

/* 各精度对应的每 tick 微秒数 */
static const float PulseTime_TickPeriod_us[] = {
    0.014f,   /* Precision_0us014 */
    0.125f,   /* Precision_0us125 */
    0.5f,     /* Precision_0us5   */
    1.0f,     /* Precision_1us    */
    10.0f,    /* Precision_10us   */
    100.0f    /* Precision_100us  */
};

#define PULSETIME_CHANNEL_COUNT  8

/**
  * @} end: PulseTime_Private_Constants
  */


/** @defgroup PulseTime_Private_Variables
  * @{
  */

/* 硬件基结构体（头文件中 extern 声明） */
PulseTime_TypeDef_Struct Pulse1_Base;
PulseTime_TypeDef_Struct Pulse2_Base;
PulseTime_TypeDef_Struct Pulse3_Base;
PulseTime_TypeDef_Struct Pulse4_Base;
PulseTime_TypeDef_Struct Pulse5_Base;
PulseTime_TypeDef_Struct Pulse6_Base;
PulseTime_TypeDef_Struct Pulse7_Base;
PulseTime_TypeDef_Struct Pulse8_Base;

/* 每通道运行时测量状态 */
static PulseTime_Runtime_Struct PulseTime_Runtime[PULSETIME_CHANNEL_COUNT];

/* 通道指针表，用于索引查找 */
static PulseTime_TypeDef_Struct* const PulseTime_ChannelTable[] = {
    &Pulse1_Base, &Pulse2_Base, &Pulse3_Base, &Pulse4_Base,
    &Pulse5_Base, &Pulse6_Base, &Pulse7_Base, &Pulse8_Base
};

/**
  * @} end: PulseTime_Private_Variables
  */


/** @defgroup PulseTime_Private_FunctionPrototypes
  * @{
  */

static uint8_t  PulseTime_GetChannelIndex(PulseTime_TypeDef_Struct* PulseTimex);
static void     PulseTime_GPIO_Config(PulseTime_TypeDef_Struct* PulseTimex);
static void     PulseTime_EXTI_Config(PulseTime_TypeDef_Struct* PulseTimex,
                                      PulseTime_InitTypeDef_Struct* initStruct,
                                      FunctionalState enableState);
static void     PulseTime_TIM_Config(PulseTime_TypeDef_Struct* PulseTimex);
static void     PulseTime_EXTI_SetTrigger(uint32_t EXTI_Line, uint8_t toRising);
static EXTITrigger_TypeDef PulseTime_GetStartTrigger(PulseTime_Memory_Struct* mem);
static void     PulseTime_IRQ_Handler(uint8_t channelIndex);

/**
  * @} end: PulseTime_Private_FunctionPrototypes
  */


/** @defgroup PulseTime_Private_Functions
  * @{
  */

/*******************************************************************************
  * @brief  根据 PulseTime 基指针获取通道索引 (0..7)。
  * @param  PulseTimex: 指向 PulseTime_TypeDef_Struct 的指针。
  * @retval 通道索引 0..7，无效时返回 0xFF。
  *******************************************************************************/
static uint8_t PulseTime_GetChannelIndex(PulseTime_TypeDef_Struct* PulseTimex)
{
    uint8_t i;
    for (i = 0; i < PULSETIME_CHANNEL_COUNT; i++) {
        if (PulseTime_ChannelTable[i] == PulseTimex)
            return i;
    }
    return 0xFF;
}

/*******************************************************************************
  * @brief  将 GPIO 引脚配置为浮空输入。
  * @param  PulseTimex: 已填充硬件映射的通道结构体。
  * @retval None.
  *******************************************************************************/
static void PulseTime_GPIO_Config(PulseTime_TypeDef_Struct* PulseTimex)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    if (PulseTimex->hd.GPIOx == NULL || PulseTimex->hd.GPIO_Pinx == (uint16_t)NULL)
        return;

    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin   = PulseTimex->hd.GPIO_Pinx;
    GPIO_Init(PulseTimex->hd.GPIOx, &GPIO_InitStructure);
}

/*******************************************************************************
  * @brief  获取起始边沿对应的 EXTI 触发值。
  * @param  mem: 指向通道配置（内存区）的指针。
  * @retval EXTI_Trigger_Rising 或 EXTI_Trigger_Falling。
  *******************************************************************************/
static EXTITrigger_TypeDef PulseTime_GetStartTrigger(PulseTime_Memory_Struct* mem)
{
    if (mem->measureType == HighLevel_time) {
        return (mem->polar == Polar_positive)
               ? EXTI_Trigger_Rising : EXTI_Trigger_Falling;
    } else if (mem->measureType == LowLevel_time) {
        return (mem->polar == Polar_positive)
               ? EXTI_Trigger_Falling : EXTI_Trigger_Rising;
    } else { /* Period_time */
        return (mem->polar == Polar_positive)
               ? EXTI_Trigger_Rising : EXTI_Trigger_Falling;
    }
}

