Blizzard1900/STM32F10x_Car_Project-V1.0.0_distanceMeasurement/User_Driver/src/stm32f10x_PulseTime.c
/*******************************************************************************
  * @brief  配置通道的 EXTI 线和 NVIC。
  * @param  PulseTimex: 已填充硬件映射的通道结构体。
  * @param  initStruct: 初始化参数。
  * @param  enableState: ENABLE 或 DISABLE，用于初始化状态。
  * @retval None.
  *******************************************************************************/
static void PulseTime_EXTI_Config(PulseTime_TypeDef_Struct* PulseTimex,
                                   PulseTime_InitTypeDef_Struct* initStruct,
                                   FunctionalState enableState)
{
    EXTI_InitTypeDef  EXTI_InitStructure;
    NVIC_InitTypeDef  NVIC_InitStructure;

    if (PulseTimex->hd.EXTI_Line == (uint32_t)NULL)
        return;

    /* 将 GPIO 端口/引脚映射到 EXTI 线 */
    GPIO_EXTILineConfig(PulseTimex->hd.EXTI_GPIO_PortSource,
                        PulseTimex->hd.EXTI_GPIO_PinSource);

    /* 配置 EXTI */
    EXTI_InitStructure.EXTI_Line    = PulseTimex->hd.EXTI_Line;
    EXTI_InitStructure.EXTI_Mode    = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = PulseTime_GetStartTrigger(&PulseTimex->mem);
    EXTI_InitStructure.EXTI_LineCmd = enableState;
    EXTI_Init(&EXTI_InitStructure);

    /* 配置 NVIC */
    NVIC_InitStructure.NVIC_IRQChannel                   = PulseTimex->hd.EXTI_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority  = initStruct->EXTIChannelPreemptionPriority;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority         = initStruct->EXTIChannelSubPriority;
    NVIC_InitStructure.NVIC_IRQChannelCmd                 = enableState;
    NVIC_Init(&NVIC_InitStructure);
}

/*******************************************************************************
  * @brief  配置定时器为自由运行计数器。
  * @param  PulseTimex: 已填充硬件映射和配置的通道结构体。
  * @retval None.
  *******************************************************************************/
static void PulseTime_TIM_Config(PulseTime_TypeDef_Struct* PulseTimex)
{
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    uint8_t                 precisionIndex;

    if (PulseTimex->hd.TIMx == NULL)
        return;

    precisionIndex = (uint8_t)PulseTimex->mem.precision;

    /* 使能定时器外设时钟 */
    if (PulseTimex->hd.TIMx == TIM6) {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
    } else if (PulseTimex->hd.TIMx == TIM2) {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    }

    TIM_TimeBaseStructure.TIM_Period        = 0xFFFF;
    TIM_TimeBaseStructure.TIM_Prescaler     = PulseTime_PSC_Table[precisionIndex];
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode   = TIM_CounterMode_Up;
    TIM_TimeBaseInit(PulseTimex->hd.TIMx, &TIM_TimeBaseStructure);

    TIM_Cmd(PulseTimex->hd.TIMx, ENABLE);
}

/*******************************************************************************
  * @brief  切换指定 EXTI 线的触发边沿。
  * @param  EXTI_Line: EXTI 线掩码（如 EXTI_Line0）。
  * @param  toRising: 1 = 设为上升沿触发，0 = 设为下降沿触发。
  * @retval None.
  *******************************************************************************/
static void PulseTime_EXTI_SetTrigger(uint32_t EXTI_Line, uint8_t toRising)
{
    if (toRising) {
        EXTI->FTSR &= ~EXTI_Line;
        EXTI->RTSR |= EXTI_Line;
    } else {
        EXTI->RTSR &= ~EXTI_Line;
        EXTI->FTSR |= EXTI_Line;
    }
}

/*******************************************************************************
  * @brief  指定通道索引的通用中断处理函数。
  * @param  channelIndex: 通道表中的 0..7 索引。
  * @retval None.
  *******************************************************************************/
static void PulseTime_IRQ_Handler(uint8_t channelIndex)
{
    PulseTime_TypeDef_Struct* PulseTimex;
    PulseTime_Runtime_Struct* runtime;
    uint32_t line;
    uint16_t currentCNT;
    uint32_t ticks;
    float    tickPeriod;
    uint8_t  pinLevel;
    uint8_t  precisionIdx;

    if (channelIndex >= PULSETIME_CHANNEL_COUNT)
        return;

    PulseTimex = PulseTime_ChannelTable[channelIndex];
    runtime    = &PulseTime_Runtime[channelIndex];
    line       = PulseTimex->hd.EXTI_Line;

    if (line == (uint32_t)NULL || PulseTimex->hd.TIMx == NULL)
        return;

    /* 仅处理本通道的 EXTI 线触发 */
    if (EXTI_GetITStatus(line) == RESET)
        return;

    EXTI_ClearITPendingBit(line);

    /* 读取引脚电平，判断触发的边沿类型 */
    pinLevel = GPIO_ReadInputDataBit(PulseTimex->hd.GPIOx, PulseTimex->hd.GPIO_Pinx);

    /* 读取定时器计数值 */
    currentCNT = TIM_GetCounter(PulseTimex->hd.TIMx);

    precisionIdx = (uint8_t)PulseTimex->mem.precision;
    tickPeriod   = PulseTime_TickPeriod_us[precisionIdx];

    if (runtime->state == PULSETIME_STATE_WAIT_START) {
        /* 起始边沿：记录起始时间戳 */
        runtime->lastCNT = currentCNT;

        /* 切换触发边沿为停止边沿 */
        if (PulseTimex->mem.measureType == Period_time) {
            /* 周期模式：保持相同边沿，下一次同边沿即一个完整周期 */
        } else {
            /* 翻转为相反边沿 */
            PulseTime_EXTI_SetTrigger(line, (pinLevel == Bit_RESET) ? 1 : 0);
        }

        runtime->state = PULSETIME_STATE_WAIT_STOP;

    } else { /* PULSETIME_STATE_WAIT_STOP */
        /* 停止边沿：计算经过的时间（处理计数器溢出回绕） */
        if (currentCNT >= runtime->lastCNT) {
            ticks = currentCNT - runtime->lastCNT;
        } else {
            ticks = currentCNT + 0x10000UL - runtime->lastCNT;
        }

        /* 根据测量类型存入对应字段 */
        if (PulseTimex->mem.measureType == HighLevel_time) {
            runtime->fHighLevelTime = (float)ticks * tickPeriod;
        } else if (PulseTimex->mem.measureType == LowLevel_time) {
            runtime->fLowLevelTime = (float)ticks * tickPeriod;
        } else { /* Period_time */
            runtime->fHighLevelTime = (float)ticks * tickPeriod;
        }

        runtime->fresh = SET;

        /* 恢复触发边沿为起始边沿，准备下一次测量 */
        if (PulseTimex->mem.measureType == Period_time) {
            /* 已在正确的边沿上 */
        } else {
            PulseTime_EXTI_SetTrigger(line, (pinLevel == Bit_RESET) ? 1 : 0);
        }

        runtime->state = PULSETIME_STATE_WAIT_START;

        /* 调用用户注册的回调函数 */
        if (PulseTimex->mem.callbackFun != NULL) {
            PulseTimex->mem.callbackFun();
        }
    }
}

/**
  * @} end: PulseTime_Private_Functions
  */


/** @defgroup PulseTime_Exported_Functions
  * @{
  */

