Blizzard1900/STM32F10x_Car_Project-V1.0.0_distanceMeasurement/User_Driver/src/stm32f10x_PulseTime.c
/*******************************************************************************
  * @brief  用默认参数填充 initStruct。
  * @param  initStruct: 指向 PulseTime_InitTypeDef_Struct 的指针，用于填充。
  * @retval ERROR or SUCCESS.
  *******************************************************************************/
ErrorStatus PulseTime_StructInit(PulseTime_InitTypeDef_Struct* initStruct)
{
    if (initStruct == NULL)
        return ERROR;

    initStruct->enableStatus                  = PULSETIME_ENABLE_STATE_DEFAULT;
    initStruct->polar                         = PULSETIME_POLAR_DEFAULT;
    initStruct->measureType                   = PULSETIME_MEASURETYPE_DEFAULT;
    initStruct->precision                     = PULSETIME_PRECISION_DEFAULT;
    initStruct->callbackFun                   = NULL;
    initStruct->EXTIChannelPreemptionPriority = EXTI_PREEMPTIONPRIORITY_DEFAULT;
    initStruct->EXTIChannelSubPriority        = EXTI_SUBPRIORITY_DEFAULT;

    return SUCCESS;
}

/*******************************************************************************
  * @brief  初始化 PulseTime 通道，填充硬件映射并配置外设。
  * @param  PulseTimex: 待初始化的通道（如 PulseTime1）。
  * @param  initStruct: 指向初始化参数的指针。
  * @retval ERROR or SUCCESS.
  *******************************************************************************/
ErrorStatus PulseTime_Init(PulseTime_TypeDef_Struct* PulseTimex,
                            PulseTime_InitTypeDef_Struct* initStruct)
{
    uint8_t channelIndex;

    if (PulseTimex == NULL || initStruct == NULL)
        return ERROR;

    channelIndex = PulseTime_GetChannelIndex(PulseTimex);
    if (channelIndex == 0xFF)
        return ERROR;

    /* ----- 填充硬件映射 ----- */
    if (PulseTimex == PulseTime1) {
        PulseTimex->hd.TIMx                 = PulseTime1_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime1_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime1_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime1_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime1_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime1_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime1_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime2) {
        PulseTimex->hd.TIMx                 = PulseTime2_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime2_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime2_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime2_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime2_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime2_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime2_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime3) {
        PulseTimex->hd.TIMx                 = PulseTime3_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime3_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime3_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime3_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime3_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime3_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime3_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime4) {
        PulseTimex->hd.TIMx                 = PulseTime4_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime4_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime4_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime4_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime4_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime4_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime4_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime5) {
        PulseTimex->hd.TIMx                 = PulseTime5_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime5_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime5_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime5_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime5_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime5_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime5_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime6) {
        PulseTimex->hd.TIMx                 = PulseTime6_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime6_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime6_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime6_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime6_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime6_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime6_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime7) {
        PulseTimex->hd.TIMx                 = PulseTime7_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime7_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime7_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime7_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime7_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime7_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime7_NVIC_IRQChannel;
    } else if (PulseTimex == PulseTime8) {
        PulseTimex->hd.TIMx                 = PulseTime8_TIMx;
        PulseTimex->hd.GPIOx                = PulseTime8_GPIOx;
        PulseTimex->hd.GPIO_Pinx            = PulseTime8_GPIOPin;
        PulseTimex->hd.EXTI_GPIO_PortSource = PulseTime8_EXTI_GPIO_PortSource;
        PulseTimex->hd.EXTI_GPIO_PinSource  = PulseTime8_EXTI_GPIO_PinSource;
        PulseTimex->hd.EXTI_Line            = PulseTime8_EXTI_Line;
        PulseTimex->hd.EXTI_IRQChannel      = PulseTime8_NVIC_IRQChannel;
    }

    /* ----- 保存配置 ----- */
    PulseTimex->mem.enable      = ENABLE;
    PulseTimex->mem.polar       = initStruct->polar;
    PulseTimex->mem.measureType = initStruct->measureType;
    PulseTimex->mem.precision   = initStruct->precision;
    PulseTimex->mem.callbackFun = initStruct->callbackFun;

