Blizzard1900/STM32F10x_Car_Project-V1.0.0_distanceMeasurement/User_Driver/src/stm32f10x_PulseTime.c
    /* ----- 复位运行时状态 ----- */
    PulseTime_Runtime[channelIndex].lastCNT        = 0;
    PulseTime_Runtime[channelIndex].state          = PULSETIME_STATE_WAIT_START;
    PulseTime_Runtime[channelIndex].fHighLevelTime = 0.0f;
    PulseTime_Runtime[channelIndex].fLowLevelTime  = 0.0f;
    PulseTime_Runtime[channelIndex].fresh          = RESET;

    /* ----- 使能 GPIO 时钟 ----- */
    if (PulseTimex->hd.GPIOx == GPIOA) {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    } else if (PulseTimex->hd.GPIOx == GPIOB) {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    } else if (PulseTimex->hd.GPIOx == GPIOC) {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    } else if (PulseTimex->hd.GPIOx == GPIOD) {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
    } else if (PulseTimex->hd.GPIOx == GPIOE) {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE);
    }

    /* 使能 AFIO 时钟（EXTI 需要） */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

    /* ----- 配置硬件 ----- */
    PulseTime_GPIO_Config(PulseTimex);
    PulseTime_TIM_Config(PulseTimex);
    PulseTime_EXTI_Config(PulseTimex, initStruct, initStruct->enableStatus);

    PulseTimex->mem.enable = initStruct->enableStatus;

    return SUCCESS;
}

/*******************************************************************************
  * @brief  打开（使能）PulseTime 通道。
  * @param  PulseTimex: 需要使能的通道。
  * @retval ERROR or SUCCESS.
  *******************************************************************************/
ErrorStatus PulseTime_Open(PulseTime_TypeDef_Struct* PulseTimex)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    uint8_t          channelIndex;

    if (PulseTimex == NULL)
        return ERROR;

    channelIndex = PulseTime_GetChannelIndex(PulseTimex);
    if (channelIndex == 0xFF)
        return ERROR;

    if (PulseTimex->hd.EXTI_Line == (uint32_t)NULL)
        return ERROR;

    PulseTimex->mem.enable = ENABLE;

    /* 复位状态机 */
    PulseTime_Runtime[channelIndex].state = PULSETIME_STATE_WAIT_START;
    PulseTime_Runtime[channelIndex].fresh = RESET;

    /* 恢复 EXTI 触发边沿为起始边沿 */
    {
        uint32_t startTrigger = PulseTime_GetStartTrigger(&PulseTimex->mem);
        PulseTime_EXTI_SetTrigger(PulseTimex->hd.EXTI_Line,
                                   (startTrigger == EXTI_Trigger_Rising) ? 1 : 0);
    }

    /* 清除可能残留的中断挂起位 */
    EXTI_ClearITPendingBit(PulseTimex->hd.EXTI_Line);

    /* 使能 EXTI 线 */
    EXTI->IMR |= PulseTimex->hd.EXTI_Line;

    /* 使能 NVIC */
    NVIC_InitStructure.NVIC_IRQChannel                   = PulseTimex->hd.EXTI_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority  = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority         = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                 = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    return SUCCESS;
}

/*******************************************************************************
  * @brief  关闭（禁用）PulseTime 通道。
  * @param  PulseTimex: 需要禁用的通道。
  * @retval ERROR or SUCCESS.
  *******************************************************************************/
ErrorStatus PulseTime_Close(PulseTime_TypeDef_Struct* PulseTimex)
{
    NVIC_InitTypeDef NVIC_InitStructure;

    if (PulseTimex == NULL)
        return ERROR;

    if (PulseTimex->hd.EXTI_Line == (uint32_t)NULL)
        return ERROR;

    PulseTimex->mem.enable = DISABLE;

    /* 禁用 EXTI 线 */
    EXTI->IMR &= ~PulseTimex->hd.EXTI_Line;

    /* 禁用 NVIC */
    NVIC_InitStructure.NVIC_IRQChannel                   = PulseTimex->hd.EXTI_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority  = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority         = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                 = DISABLE;
    NVIC_Init(&NVIC_InitStructure);

    return SUCCESS;
}

/*******************************************************************************
  * @brief  从 PulseTime 通道读取测量数据。
  * @param  PulseTimex: 需要读取的通道。
  * @param  pdata: 指向 PulseTime_Data_Struct 的指针，用于接收数据。
  *         - fresh:          数据更新标志
  *         - fHighLevelTime: 高电平时间 (us)
  *         - fLowLevelTime:  低电平时间 (us)
  * @retval ERROR or SUCCESS.
  *******************************************************************************/
ErrorStatus PulseTime_ReadData(PulseTime_TypeDef_Struct* PulseTimex,
                                PulseTime_Data_Struct* pdata)
{
    uint8_t channelIndex;

    if (PulseTimex == NULL || pdata == NULL)
        return ERROR;

    channelIndex = PulseTime_GetChannelIndex(PulseTimex);
    if (channelIndex == 0xFF)
        return ERROR;

    pdata->fresh          = PulseTime_Runtime[channelIndex].fresh;
    pdata->fHighLevelTime = PulseTime_Runtime[channelIndex].fHighLevelTime;
    pdata->fLowLevelTime  = PulseTime_Runtime[channelIndex].fLowLevelTime;

    /* 读取后清除更新标志 */
    PulseTime_Runtime[channelIndex].fresh = RESET;

    return SUCCESS;
}

/*******************************************************************************
  * @brief  PulseTime1 中断处理实现。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime1_IRQHandler(void)
{
    PulseTime_IRQ_Handler(0);
}

/*******************************************************************************
  * @brief  PulseTime2 中断处理实现。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime2_IRQHandler(void)
{
    PulseTime_IRQ_Handler(1);
}

/*******************************************************************************
  * @brief  PulseTime3 中断处理实现。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime3_IRQHandler(void)
{
    PulseTime_IRQ_Handler(2);
}

/*******************************************************************************
  * @brief  PulseTime4 中断处理实现。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime4_IRQHandler(void)
{
    PulseTime_IRQ_Handler(3);
}

/*******************************************************************************
  * @brief  PulseTime5 中断处理实现。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime5_IRQHandler(void)
{
    PulseTime_IRQ_Handler(4);
}

/*******************************************************************************
  * @brief  PulseTime6 中断处理实现。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime6_IRQHandler(void)
{
    PulseTime_IRQ_Handler(5);
}

/*******************************************************************************
  * @brief  PulseTime7 中断处理（未使用通道，空桩）。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime7_IRQHandler(void)
{
    /* 通道 7 无硬件映射 */
}

/*******************************************************************************
  * @brief  PulseTime8 中断处理（未使用通道，空桩）。
  * @param  None.
  * @retval None.
  *******************************************************************************/
void PulseTime8_IRQHandler(void)
{
    /* 通道 8 无硬件映射 */
}

/**
  * @} end: PulseTime_Exported_Functions
  */


/**
  * @} end: PulseTime_Drivers
  */

/**
  * @}
  */

/********* (C) COPYRIGHT 2014 HANGZHOU NORMAL UNIVERSITY  *****END OF FILE****/
